Repository: 270292082/Hope4All
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: mi, my_mm

source: Search
mi: Rapua
my_mm: ရှာဖွေရန်

source: Logout
mi: Takiputa
my_mm: ထွက်ရန်

source: Sign Up
mi: Rēhita
my_mm: အကောင့်ဖွင့်

source: Sign In
mi: Takiuru
my_mm: လော့ဂ်အင်

source: Report Missing Person
mi: Pūrongo Tangata Ngaro
my_mm: လူပျောက်ကြော်ငြာမည်

source: yrs
mi: tau
my_mm: နှစ်

source: Missing Person Information
mi: Ngā Mōhiohio mō te Tangata Ngaro
my_mm: ပျောက်ဆုံးနေသူ၏ အချက်အလက်များ

source: Country
mi: Whenua
my_mm: နိုင်ငံ

source: Incident Related
mi: Pānga ki tētahi Take
my_mm: သက်ဆိုင်ရာဖြစ်စဉ်

source: Name
mi: Ingoa
my_mm: အမည်

source: Age
mi: Tau
my_mm: အသက်

source: Identification Mark
mi: Tohu Motuhake
my_mm: ထင်ရှားသောအမှတ်အသား

source: Reporter Contact Information
mi: Ngā Mōhiohio Whakapā a te Kaituku Pūrongo
my_mm: တွေ့ရှိပါက ဆက်သွယ်ရန်

source: Missing Since
mi: Ngaro Mai i te
my_mm: စတင်ပျောက်ဆုံးသောနေ့စွဲ

source: Last Known Location
mi: Te Wāhi i Mōhiotia Whakamutunga
my_mm: နောက်ဆုံးသိရှိသည့်တည်နေရာ

source: Additional Information
mi: Mōhiohio Anō
my_mm: ထပ်ဆောင်း အချက်အလက်

source: Edit
mi: Whakatika
my_mm: ပြင်ဆင်ရန်

source: Found!
mi: Kua Kimihia!
my_mm: တွေ့ရှိခဲ့သည်!

source: Identification Mark :
mi: Tohu Motuhake:
my_mm: ထင်ရှားသောအမှတ်အသား -

source: Contact Information :
mi: Ngā Mōhiohio Whakapā:
my_mm: ဆက်သွယ်ရန်အချက်အလက် -

source: No matching results found.
mi: āore i kitea he hua e ōrite ana.
my_mm: ကိုက်ညီသောရလဒ်များ မတွေ့ပါ။

source: Back to Home
mi: Hoki ki te Kāinga
my_mm: ပင်မစာမျက်နှာသို့ပြန်သွားရန်
